SET NAMES UTF8;
DROP DATABASE IF EXISTS vg;
CREATE DATABASE vg CHARSET=UTF8;
USE vg;

-- vg_user
CREATE TABLE vg_user(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  nickName VARCHAR(4),
  sex VARCHAR(1),
  contact VARCHAR(11),
  qq VARCHAR(14),
  platform VARCHAR(64),
  timing VARCHAR(32),
  liveTelecastRoom VARCHAR(64),
  videoUrl VARCHAR(128),
  selfIntroduction VARCHAR(128) 
);

-- vg_academy_text
CREATE TABLE vg_academy_text(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  items VARCHAR(1024),
  seq_academy TINYINT,
  seq_mode TINYINT,
  seq_advance TINYINT,
  seq_equipment TINYINT
);

-- vg_academy_img
CREATE TABLE vg_academy_img(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  pic VARCHAR(128),
  textp VARCHAR(64),
  seq_academy TINYINT,
  seq_mode TINYINT,
  seq_advance TINYINT,
  seq_equipment TINYINT
);

-- vg_features_item
CREATE TABLE vg_features_item(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  pic VARCHAR(128),
  texth2 VARCHAR(64),
  texth4 VARCHAR(64),
  textp VARCHAR(64),
  seq_recommended TINYINT
);

-- vg_news_items
CREATE TABLE vg_news_items(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  href VARCHAR(128),
  pic VARCHAR(128),
  title VARCHAR(64),
  news_body VARCHAR(64),
  news_date VARCHAR(32),
  seq_recommended TINYINT,
  seq_newest TINYINT,
  seq_new_arrival TINYINT,
  seq_edition TINYINT
);


-- 数据导入

-- vg_user
INSERT INTO vg_user VALUES
(NULL, '吴敦锴' , '男', '15070234551', '2464494677', '没有', '', '没有', '没有','没有');

-- vg_academy_text
INSERT INTO vg_academy_text VALUES
(NULL, '<h4>欢迎来到虚荣学院！</h4><br/><p>虚荣是第一款跨平台的MOBA游戏。</p><p>让我们从基础开始，包教包会！</p><ul><li>仔细观看学院导师精心制作的记录影像</li><li>学习通过局部操作，摧毁/占领目标物，团队合作，以及视野控制来达到战略目标。</li><li>您可以通过不同的出装和选择让不同的技能升至满级，让每位英雄拥有多种玩法。</li><li>你在进入游戏后，也可以随时从“学院”栏目中找到这些教学视频。边打边学，轻松上手</li><li>牢固的基础是从战士通向大师的必经之路！</li></ul>' , 1, 0, 0, 0),
(NULL, '<h4>对抗炮塔</h4><br/><ul><li>炮塔负责守护通往基地的道路；</li><li>需毁灭5个炮塔才能攻击虚荣水晶；</li><li>炮塔会自动攻击射程内的英雄，离开射程范围攻击即会停止；</li><li>在小兵的掩护下接近炮塔可防止被直接攻击；</li><li>如果在炮塔射程内攻击对方英雄，炮塔会首先瞄准你。</li></ul>' , 2, 0, 0, 0),
(NULL, '<h4>对抗炮塔</h4><br/><ul><li>炮塔负责守护通往基地的道路；</li><li>需毁灭5个炮塔才能攻击虚荣水晶；</li><li>炮塔会自动攻击射程内的英雄，离开射程范围攻击即会停止；</li><li>在小兵的掩护下接近炮塔可防止被直接攻击；</li><li>如果在炮塔射程内攻击对方英雄，炮塔会首先瞄准你。</li></ul>' , 3, 0, 0, 0),
(NULL, '<h4>摧毁炮塔</h4><br/><ul><li>炮塔有自带护盾，只有在攻击状态才会解除；</li><li>有己方小兵顶在前面才是攻击炮塔的最佳时机；</li><li>炮塔被摧毁时会爆炸，记得远离！</li></ul>' , 4, 0, 0, 0),
(NULL, '<h4>赚取更多的金币来购买装备吧！</h4><br/><ul><li>获取金币的方式有两种：<ul><li>1）英雄会缓慢的自动获得金币</li><li>2）通过助攻或者击杀敌方人员</li></ul></li><li>黄色数字即为获得的金币数；</li><li>完成对小兵的最后一击便能获得比平常多得多的金币！注意身边血量低的小兵！</li></ul>' , 5, 0, 0, 0),
(NULL, '<h4>商城</h4><br/><ul><li>在商城里，您可以购买到宝箱、皮肤、天赋、稀有钥匙、稀有材料和表情等商品；</li><li>宝箱内为可见或不可见的商品组合，除了自行购买，每过一段时间还会有两个免费的宝箱等您来开启！</li><li>商城内可使用的货币为ICE和荣耀，两者都可使用实际货币进行兑换。</li></ul><div class="tips_wrap"><h6>新手贴士</h6>注意：英雄无法在商城内购买，如需获取某一英雄，请前往英雄列表后点击该英雄的图标，进入详情页后支付相应的ICE或荣耀值进行解锁</div>' , 6, 0, 0, 0),
(NULL, '<h4>常规的游戏模式将有：</h4><br/><ul><li>5V5匹配赛</li><li>5V5排位赛</li><li>3V3排位赛</li><li>极限乱斗</li><li>闪电战</li><li>我们没有将3V3匹配赛列进去。因为我们正在对3V3进行优化调整。</li><li>极限乱斗是4.0版之前一个相对较受欢迎的模式。由于我们希望有个模式兼顾短时长和不使用天赋，所以我们将极限乱斗列为了常规模式之一。</li></ul>' , 0, 1, 0, 0),
(NULL, '<h4>基本介绍</h4><br/><ul><li>对战的终极目的是毁灭敌方的虚荣水晶；</li><li>为了毁灭虚荣水晶，需至少摧毁一条行进路线上的所有防御炮塔和兵营；</li><li>地图上共有三条行进路线，被一条河流从中间横段，野区商店就开在河边，可从中购买装备；</li><li>在游戏中期，野怪也会出现在河边，击杀可使其归为我方战力！</li></ul>' , 0, 2, 0, 0),
(NULL, '<h4>通过排位赛来证明自己的实力吧！</h4><br/><ul><li>排位赛与5V5匹配赛差别不大，对战开始时双方可依次禁用一位英雄；</li><li>选择禁用英雄后可挑选自己想用的英雄，被挑选的英雄将无法被另一方选择；</li><li>选择过程中可与队友通过聊天框交流战略；</li><li>玩家账户必须达到十级并至少拥有14个解锁英雄才能解锁排位赛模式。</li></ul>' , 0, 3, 0, 0),
(NULL, '<h4>队伍安排</h4><br/><ul><li>游戏初期，一条路线上至少要有一位玩家，需为强力输出的英雄；</li><li>中间线路英雄的选择需绝对慎重，因其具有支援两侧路线的能力；</li><li>至少得有一个成员负责清理己方野区及一位队长来辅助打野。</li></ul>' , 0, 4, 0, 0),
(NULL, '<h4>河流增益</h4><br/><ul><li>河流将地图分为两块，顺着河流方向移动可使英雄获得加速效果，及时支援远处的路线。</li></ul>' , 0, 5, 0, 0),
(NULL, '<h4>虚荣水晶</h4><br/><ul><li>虚荣水晶的第一波攻击会锁定敌方英雄，然后多枚导弹齐发，造成伤害与减速；</li><li>虚荣水晶的第二波攻击会一直线射出爆炸攻击，造成伤害和晕眩；</li><li>水晶周围有护盾保护，需毁灭周围的兵营才能对其造成伤害。</li></ul>' , 0, 6, 0, 0),
(NULL, '<h4>兵营</h4><br/><ul><li>兵营共三个，围绕在虚荣水晶周围负责为其防御提供能量；</li><li>当敌方一个兵营被毁，那条路上的小兵的攻击力就会被增强。</li></ul>' , 0, 7, 0, 0),
(NULL, '<h4>暗爪</h4><br/><ul><li>暗爪出现在游戏后期，降临时小地图上会有圆圈提示；</li><li>击败暗爪会获得它的效忠，使其沿中路向敌方推进。</li></ul>' , 0, 8, 0, 0),
(NULL, '<h4>小兵指挥官</h4><br/><ul><li>每隔一段时间便会有一位小兵指挥官从虚荣水晶中走出；</li><li>小兵指挥官可帮助我方小兵减少来自敌方炮台和敌方小兵的伤害。</li></ul>' , 0, 9, 0, 0),
(NULL, '<h4>传送靴</h4><br/><ul><li>传送靴可让英雄传送至本方兼职、小兵或侦查之眼的附近；</li><li>使用步骤：点击装备图标→点击特定的建筑物/小兵/侦查之眼→完成传送；</li><li>传送过程中目标建筑物/小兵/侦查之眼将会获得短暂的保护。</li></ul>' , 0, 10, 0, 0),
(NULL, '<h4>侦查之眼</h4><br/><ul><li>侦查之眼可在一个区域内提供一小段时间的视野；</li><li>每位玩家标配两个侦查之眼；</li><li>使用方法：点击英雄技能旁的按钮→选择安防视野的位置。</li></ul>' , 0, 11, 0, 0),
(NULL, '<h4>欢迎来到海希安城</h4><ul><li>所有英雄齐聚于此，为的就是海希安之井；</li><li>这个古老的能量源泉能为技能与魔法二者提供惊人的力量。然而，古井只偶尔释放这种能量。若想要独占这一能量，英雄们就必须通过战斗来夺取井水的控制权；</li><li>单打独斗的代价是沉重的，英雄们创建了各自的三人队伍，准备在战斗中与对手一争高低。</li></ul>' , 0, 12, 0, 0),
(NULL, '<h4>目标：摧毁敌方基地</h4><ul><li>每支队伍都拥有一个巨大的虚荣水晶，用来储存来自的古井的能量。</li><li>摧毁敌方防御，粉碎敌方虚荣水晶，以赢得比赛胜利！</li></ul>' , 0, 13, 0, 0),
(NULL, ' <h4>基地防御</h4><ul><li>虚荣水晶非常易碎，所以我们的英雄们为它们建造了复杂的防御体系；</li><li>战争开始时，最脆弱的是距离各自基地距离最远的两座防御塔。摧毁它们，再去摧毁守卫在晶体周围的防御！</li><li>除了防御塔，虚荣水晶自身还会不断召唤小兵守卫自己。这些小兵会随各方英雄一同向对方基地前进，攻击遇到的所有敌人。</li></ul>' , 0, 14, 0, 0),
(NULL, '<h4>圣域</h4><ul><li>圣域是英雄的庇护之地，待在圣域里伤害便会降低，同时帮助英雄迅速恢复生命值和能量；</li><li>除此之外，圣域里还有家道具店，可使用金币在其中购买装备；</li><li>当您的生命值较低或需要购买装备时，找个安全的地方，点击传送回城按钮便可回到基地；</li><li>切记，如果您在传送过程中受到伤害，或者进行了移动或攻击等操作，传送将被取消。</li></ul>' , 0, 15, 0, 0),
(NULL, '<h4>关于对线</h4><ul><li>推进路线指的是靠近海希安城上方的那条连接双方基地的狭长石径，每支队伍的小兵会在各自炮塔的保护下沿这条路线前进；</li><li>小兵是获得金币和经验的重要来源。此外，对线会为许多远程英雄提供庇护；</li><li>推荐在游戏前期使用一名法师或狙击手英雄进行对线。</li></ul>' , 0, 16, 0, 0),
(NULL, '<h4>炮塔</h4><ul><li>接近炮塔时务必确保己方小兵走在前面，让它们承受炮塔的伤害，这样您就可以进行攻击了；</li><li>尽量在己方最后一名小兵阵亡前撤退，如果没有小兵，炮塔将攻击附近的英雄；</li><li>无论有没有小兵，当您攻击敌方英雄时，对方的炮塔将立即攻击您！</li></ul>' , 0, 17, 0, 0),
(NULL, '<h4>野怪</h4><ul><li>野怪是栖息在野区里的中立生物，不忠实于任何队伍，但却是获取金币和经验的重要来源。被击杀后还将会重新出现在该营地里，为英雄们带来再次获得奖励的机会；</li><div class="tips_wrap"><h6>新手贴士</h6>Vainglory的野区设计可容纳每支队伍的两名玩家在野区获得金钱和经验。这两名玩家既可随等级平均分配金钱和击杀奖励，也可以一名玩家集中打野而另一名玩家在野区和线上游走。</div><li>如果杀死近期未遭受击杀的野怪，还会获得额外的奖励，当您发现敌人长时间在野区之外，那么可以考虑侵入对方野区，偷杀他们的野怪；</li><li>此外，野怪永不会抛弃自己的巢穴，当它们被您吸引至距离巢穴过远的地方时会立即转身回到巢穴并迅速恢复自身生命值。</li></ul>' , 0, 18, 0, 0),
(NULL, '<h4>野区商店</h4><ul><li>野区中央的商店为双方队伍提供了便利，玩家不必返回圣域就能购买装备。野区商店出售的装备与基地商店的装备一致；</li><li>虽然野区商店的位置方便，但很危险。购买装备时，尽量呆在树丛里并迅速完成购买，以免遭受敌人攻击；</li><li>时间就是金币，如果您购买装备花的时间过长，您将失去在其他地方获取金币的机会，最好事先想好要买什么。</li></ul>' , 0, 19, 0, 0),
(NULL, '<h4>水晶哨兵</h4><p>您的队伍可以通过击水晶哨兵工来占领水晶矿，占领后新召唤的小兵们的力量便会被增强。如果您的队伍同时控制两个水晶矿，那么己方小兵的力量将达到最大；</p><ul><li>为持续获得来自水晶矿的加成，您的队伍需要在敌人攻击水晶矿时对其进行防御。如果敌方夺取水晶矿，己方小兵将失去之前获得的力量；</li><li>占领水晶矿并非总是越早越好。力量得到增强的小兵将迅速击败敌方小兵，并直推敌方炮塔。这将使己方对线英雄陷入两难境地：是冒着被伏击的危险上前补刀，还是放弃获取金币的机会？</li></ul>' , 0, 20, 0, 0),
(NULL, '<h4>金矿工</h4><ul><li>您的队伍可以通过击杀金矿工来占领金矿。占领金矿后，己方队伍的每名英雄均将获得当前金矿中金币奖励的一部分。玩家可以通过查看小地图中间的刻度盘来关注金币奖励数额的变化；</li><li>如果己方持续控制金矿达到一个采矿周期，己方队伍将自动获得一批金币。要获取金币，不仅要在敌方队伍袭击时守卫金矿，还要在金矿快满时分散敌方的注意力；</li><li>通常来说，最好等金矿开采至约三分之二后再采取行动进行占领。然而，若您想阻止敌方取大笔金币，而对方又占据上风，那么在安全的时候伺机夺取金矿也未尝不可。</li></ul>' , 0, 21, 0, 0),
(NULL, '<h4>海怪克拉肯</h4><ul><li>金矿工越挖越深，最终，唤醒了沉睡的海怪克拉肯。这个危险的生物会杀死金矿工并取代它的位置；</li><li>海怪克拉肯被俘获后将为其队伍作战，在对线上肆虐并攻击敌方炮塔。如果放任不管，它将一路摧毁炮塔——甚至可能在这之后直捣虚荣晶体；</li><li>哪方给海怪克拉肯最后一击，它就会为哪方作战，因此英雄们还应留意敌人所处的位置；</li><li>若防守方能阻止海怪克拉肯的进攻并击杀它，那么防守方的每位英雄都将获得丰厚的金币奖励。</li></ul>' , 0, 22, 0, 0),
(NULL, '<h4>基本介绍</h4><ul><li>在极限乱斗中，玩家将会被随机分配一名英雄</li><li>整场游戏也只有对线的部分</li><li>胜利的条件就是摧毁对方的虚荣水晶</li><li>玩家可以像往常一样购买装备，但是一旦迈出基地便无法返回</li></ul>' , 0, 23, 0, 0),
(NULL, '<h4>基本介绍</h4><ul><li>闪电战模式是一种节奏非常快的游戏模式</li><li>游戏时长通常在5分钟或者更少。</li><li>率先获得15分或者游戏时间结束后得分更多的那一方获得胜利</li><li>击杀一名敌人获得1分，击杀水晶哨兵，中部哨兵或者摧毁炮塔可获3分。</li><li>游戏开场便可拥有较高的等级和较多的金币</li></ul>' , 0, 24, 0, 0),
(NULL, 'h4>如何获得额外的金币？</h4><br/><ul><li>成功击杀敌方时，如果身边有队友，那么他将获得额外的金币；</li><li>如果队友为复数，则这份额外的金币会给到金币数获得最少的英雄；</li><li>因此，团队行动有助于队伍获得更多的金币！</li></ul>' , 0, 0, 1, 0),
(NULL, '<h4>关于技能满级的基础知识</h4><br/><ul><li>技能升级5次便可达到满级；</li><li>满级会使技能大幅度的增加或为此技能增加一个全新的特性；</li><li>虚荣中能获得的技能点最多为12点，而三个技能全部满级需要13个技能点，选择将哪两个技能升到满级尤为重要。</li></ul>' , 0, 0, 2, 0),
(NULL, ' <h4>视野和草丛</h4><ul><li>特殊地形可阻断视野，使隐藏其中的英雄不被发现；</li><li>草丛便是一种特殊地形，能隐藏身影还不影响移动；</li><li>如在草丛中发动攻击则隐身状态会取消。此外，当有敌方玩家进入草丛时，您也会因此脱离隐身状态。</li></ul>' , 0, 0, 3, 0),
(NULL, '<h4>对线</h4><br/><ul><li>对线指连接两端基地的石道；</li><li>两队都有各自的炮塔来保护在石道上行动的英雄和小兵；</li><li>建议玩家在比赛刚开始的前几分钟不要越过对线中央的金色圆环。</li></ul>' , 0, 0, 4, 0),
(NULL, '<h4>团队构成</h4><br/><ul><li>指挥：最重要最困难的角色，决定团队进攻与撤退的时间点，需吸收大量的伤害并保护队友，确保输出的存活；</li><li>输出：持续给敌方伤害，但极易被杀，需平衡防御与输出，并紧跟指挥；</li><li>打野：职责为尽可能快的击杀敌方输出。</li></ul>' , 0, 0, 5, 0),
(NULL, '<h4>计分板</h4><br/><ul><li>可通过点击游戏屏幕右下角的图标打开计分板；</li><li>计分板内有双方战队各自的击杀统计及装备列表，点击装备图标便能了解此装备的具体功能。</li></ul>' , 0, 0, 6, 0),
(NULL, '<h4>跑得快点，再快点！</h4><br/><ul><li>靴类装备位于商店的辅助页和推荐页中；</li><li>可使英雄在地图上更快的移动，方便追击和撤退，甚至加强防御；</li><li>通过点击游戏左下角的靴类图标激活装备可短暂的使英雄的速度瞬间爆发。</li></ul>' , 0, 0, 0, 1),
(NULL, '<h4>把握住敌方的一举一动！</h4><br/><ul><li>视野装备可在商店的消耗品页面找到，分侦查陷阱和信号弹两种；</li><li>信号弹能临时性的增加视野广度；</li><li>侦查陷阱一经激活便长期有效，且对敌方不可见，如有敌方英雄从上经过便会引爆，只能释放于当前所站立的位置。</li></ul>' , 0, 0, 0, 2),
(NULL, '<h4>好的防御对取胜至关重要！</h4><br/><ul><li>格挡护腕可在商店的防御页找到；</li><li>游戏时点击其图标就可暂时达到抵御伤害或负面影响的效果；</li><li>格挡护腕还能搭配熔炉及庇护使用，熔炉能让队友也获得格挡效果而庇护则能加强自身的防御。</li></ul>' , 0, 0, 0, 3);

-- vg_academy_img
INSERT INTO vg_academy_img VALUES
(NULL, 'http://127.0.0.1:3000/academy/academy/view.jpg', '', 1, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/academy/celeste.jpg' ,'选择英雄', 2, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/academy/move.jpg', '攻击和移动', 3, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/academy/skill.jpg', '英雄技能', 4, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/academy/winning.jpg', '赢取胜利', 5, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/academy/p1_p3_p1.jpg', '', 6, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/academy/p1_p3_p1.jpg', '', 7, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/academy/p1_p4_p1.jpg', '', 8, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/academy/p1_p5_p1.jpg', '', 9, 0, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/view.jpg', '游戏介绍', 0, 1, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p2_p2_p2.jpg', '常规赛', 0, 2, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p2_p2_p3.jpg', '排位', 0, 3, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p2_p1_p1.jpg', '', 0, 4, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p1_p1.jpg', '', 0, 5, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p2_p1.jpg', '', 0, 6, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p2_p2.jpg', '', 0, 7, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p3_p1.jpg', '', 0, 8, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p3_p2.jpg', '', 0, 9, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p4_p1.jpg', '金橡树', 0, 10, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p4_p2.jpg', '物理树精', 0, 11, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p4_p3.jpg', '法术树精', 0, 12, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p4_p4.jpg', '魔翼', 0, 13, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p5_p1.jpg', '', 0, 14, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p5_p2.jpg', '', 0, 15, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p6_p1.jpg', '', 0, 16, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p6_p6_p2.jpg', '', 0, 17, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/THE-HALCYON-FOLD-WELCOME.jpg', '', 0, 18, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/THE-HALCYON-FOLD-OBJECTIVE.jpg', '', 0, 19, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/TEAM-BASES-Shatter-The-Vain-Crystal-2.jpg', '', 0, 20, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/TEAM-BASES-Shatter-The-Vain-Crystal-2.jpg', '', 0, 21, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/TEAM-BASES-Shatter-The-Vain-Crystal.jpg', '', 0, 22, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/TEAM-BASES-Shatter-Cascading.jpg', '', 0, 23, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/TEAM-BASES-SANCTUARY.jpg', '', 0, 24, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/THE-LANE-THE-ROAD-TO-VICTORY.jpg', '', 0, 25, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/THE-LANE-Turrets.jpg', '', 0, 26, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/THE-JUNGLE-MONSTERS.jpg', '', 0, 27, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/THE-JUNGLE-Monsters (2).jpg', '', 0, 28, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/THE-JUNGLE-Shop.jpg', '', 0, 29, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p3_p3_p2.jpg', '', 0, 30, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p3_p3_p3.jpg', '', 0, 31, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/SPECIAL-CREATURES-THE-KRAKEN.jpg', '', 0, 32, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p2_p2_p1.jpg', '', 0, 33, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/mode/p2_p2_p4.jpg', '', 0, 34, 0, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p3_p1_p1.jpg', '', 0, 0, 1, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p3_p2_p1.jpg', '', 0, 0, 2, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p3_p3_p1.jpg', '团灭状态', 0, 0, 3, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p3_p3_p2.jpg', '水晶哨兵', 0, 0, 4, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p3_p3_p3.jpg', '金矿工', 0, 0, 5, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p3_p3_p4.jpg', '海怪克拉肯', 0, 0, 6, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p5_p3_p1.jpg', '小兵', 0, 0, 7, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p5_p3_p2.jpg', '野区', 0, 0, 8, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p5_p3_p3.jpg', '野区营地', 0, 0, 9, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p5_p3_p4.jpg', '拉野', 0, 0, 10, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p5_p1_p1.jpg', '', 0, 0, 11, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p5_p1_p2.jpg', '', 0, 0, 12, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p5_p2_p1.jpg', '', 0, 0, 13, 0),
(NULL, 'http://127.0.0.1:3000/academy/advance/p5_p2_p2.jpg', '', 0, 0, 14, 0),
(NULL, 'http://127.0.0.1:3000/academy/equipment/p4_p1_p1.jpg', '', 0, 0, 0, 1),
(NULL, 'http://127.0.0.1:3000/academy/equipment/p4_p2_p1.jpg', '', 0, 0, 0, 2),
(NULL, 'http://127.0.0.1:3000/academy/equipment/p4_p3_p1.jpg', '', 0, 0, 0, 3);

-- vg_features_item
INSERT INTO vg_features_item VALUES
(NULL, 'home/features_pic_1.png' ,'E.V.I.L引擎' ,'打造绝佳画质','支持120帧激烈的团战。精致绝美的地图、巨龙和野怪，让您在这个栩栩如生的世界沉醉。' , 1),
(NULL, 'home/features_pic_2.png' ,'专业级的' ,'MOBA体验','真正的战争迷雾，真实的对线、游走抓人和团战。操控强大的原创英雄，探索灵活的出装路线。' , 2),
(NULL, 'home/features_pic_3.png' ,'为触屏而生' ,'的超凡手感','同时配备摇杆和点触双操控模式，提供团战中大杀四方所需的跟手性和自主性。' , 3);

-- vg_news_items内容
INSERT INTO vg_news_items VALUES
(NULL, '/news/1000102' ,'news/prod_2018-09-20_1.jpg' ,'神秘宝箱中奖率说明' , '关于游戏内神秘宝箱中奖率说明' ,'发布日期：2018-09-20 14:32:23' , 0, 1, 1, 0),
(NULL, '/news/1000012' ,'news/prod_2018-09-21_1.jpg' ,'虚荣5V5玩法的未来方向' , '当我们在3.7版本中做出了一系列关于玩法的调整后，现在我们想要花些时间，来谈谈5V5模式未来的发展方向。' ,'发布日期：2018-09-21 10:00:00' , 0, 2, 2, 0),
(NULL, '/news/1000011' ,'news/prod_2018-10-15_1.jpg' ,'3.8版本：英雄&装备平衡性调整' , '感谢大家多等待了两周时间，让我们能更专注的对游戏质量进行优化！其实，除了已经公布的内容外，还有一些改进优化正在进行中，它们将在接下来的几个月内与大家见面，游戏体验也将更上一层楼。不过现在，我们还是想先和大家分享下本期的更新内容。 ' ,'发布日期：2018-10-15 10:19:00' , 0, 3, 0, 1),
(NULL, '/news/1000010' ,'news/prod_2018-10-15_2.jpg' ,'3.8版本：‘森林守护者’伊娜' , '感谢大家多等待了两周时间，让我们能更专注的对游戏质量进行优化！其实，除了已经公布的内容外，还有一些改进优化正在进行中，它们将在接下来的几个月内与大家见面，游戏体验也将更上一层楼。不过现在，我们还是想先和大家分享下本期的更新内容。' ,'发布日期：2018-10-15 10:44:00' , 0, 4, 0, 2),
(NULL, '/news/1000014' ,'news/prod_2018-11-12_1.jpg' ,'虚荣CVPL第二赛段第四轮明日19点再燃战火' , '《虚荣》CVPL（虚荣中国区超级联赛）第二赛段第四轮的比赛将于11月13日（本周二）19点继续上演。想要获得决赛期间的免赛晋级资格，接下来的每一场战斗都不容有失。让我们一起期待《虚荣》战队新一轮的精彩表演！' ,'发布日期：2018-11-22 10:00:00' , 0, 5, 3, 0),
(NULL, '/news/1000016' ,'news/prod_2018-11-22_1.jpg' ,'“双倍荣耀”助阵虚荣CVPL联赛 “黑五”来袭抢限皮' , '这个周末，虚荣CVPL联赛、“双倍荣耀”、“黑五”盛宴，活动三连发！与《虚荣》一起狂欢吧！' ,'发布日期：2018-11-22 16:00:00' , 0, 6, 4, 0),
(NULL, '/news/1000017' ,'news/prod_2018-12-26_1.jpg' ,'虚荣CVPL本周迎来天王山战役 看直播送天赋币' , '《虚荣》CVPL（虚荣中国区超级联赛）第二赛段第六轮的比赛将在本周六（12月1日）16点上演强强对决。同时，在这个周末，记得在游戏内参加看直播送天赋币活动！为你喜爱的虚荣战队加油，限时领史诗天赋币奖励' ,'发布日期：2018-11-29 11:00:00' , 0, 7, 5, 0),
(NULL, '/news/1000018' ,'news/prod_2018-12-05_1.jpg' ,'喜迎《虚荣》3周年，限时送皮肤' , '2015年11月，《虚荣》国服正式上线，转眼间三年已过。为了感谢各位玩家的陪伴和支持，《虚荣》官方特地为国服玩家准备了3周年礼品一份！' ,'发布日期：2018-12-05 11:00:00' , 0, 8, 6, 0),
(NULL, '/news/1000019' ,'news/prod_2018-12-26_1.jpg' ,'虚荣CVPL第七周预告，一大波天赋币继续送出！' , '《虚荣》CVPL”（即虚荣中国区超级联赛）第二赛段第七轮的比赛将于12月8日这周六下午四点准时打响。比赛期间，【游戏内看直播送天赋币活动】仍将继续，欢迎届时守候！' ,'发布日期：2018-12-06 15:00:00' , 0, 9, 7, 0),
(NULL, '/news/1000020' ,'news/prod_2018-12-10_1.jpg' ,'再战海希安 《虚荣》3周年主播招募' , '为庆《虚荣》三周年，12月10日至12月25日虚荣官方联动触手直播再次展开主播招募活动！丰厚的现金奖励和直播间首推机会等你来抢！' ,'发布日期：2018-12-10 10:00:00' , 0, 10, 8, 0),
(NULL, '/news/1000021' ,'news/prod_2018-12-11_1.jpg' ,'3.9版本更新：‘奥术贤王’马格纳斯' , '此次更新将为大家带来一位全新的英雄——“奥术贤王”马格纳斯！这是位法力高强的奥术大师，能从远程对敌人造成群体伤害！除此以外我们还制作了六款全新的皮肤和一些可收集的新物品。' ,'发布日期：2018-12-11 15:00:00' , 0, 11, 0, 3),
(NULL, '/news/1000022' ,'news/prod_2018-12-12_1.jpg' ,'《虚荣》3周年 虚荣锦鲤上线了！' , '继人人可得的三周年皮肤礼品公布后，在这个热闹的庆生季，《虚荣》官方还为众多幸运粉丝追加了各式各样的大礼包！从今天起至12月20日，参与指定《虚荣》官方微博话题转发活动即可抽取“虚荣锦鲤”并有机会解锁全部英雄！' ,'发布日期：2018-12-12 15:00:00' , 0, 12, 9, 0),
(NULL, '/news/1000023' ,'news/prod_2018-12-14_1.jpg' ,'3.9版本：英雄&装备平衡性调整' , '这篇文章里，我们将为大家着重介绍3.9新版本内英雄和装备方面的设定调整' ,'发布日期：2018-12-14 15:00:00' , 0, 13, 0, 4),
(NULL, '/news/1000024' ,'news/prod_2018-12-14_2.jpg' ,'3.9版本更新：冬季赛风暴试炼' , '3.9版本将是一个充满阳光的世界！在回归的冬季赛中，我们为大家准备了全新的风暴试炼&赛季阳光系统。奖励将变得更丰富，游戏也会更加有趣！' ,'发布日期：2018-12-14 17:00:00' , 0, 14, 0, 5),
(NULL, '/news/1000025' ,'news/prod_2018-12-19_1.jpg' ,'虚荣CVPL本周六决赛 观看直播抢皮肤' , '《虚荣》CVPL第二赛段的比赛现终于进入倒计时阶段！这周六12月22日下午三点，决赛将正式打响！观看直播就有机会获取皮肤，还有神秘女嘉宾进行赛事解说！' ,'发布日期：2018-12-19 16:56:43' , 0, 15, 10, 0),
(NULL, '/news/1000026' ,'news/prod_2018-12-26_1.jpg' ,'恭喜Hunters夺得 2018虚荣CVPL总冠军' , '北京时间2018年12月22日，“《虚荣》CVPL”（即虚荣中国区超级联赛）总决赛于当日完成精彩对决，最终Hunters战队夺得了本次赛事总冠军！' ,'发布日期：2018-12-26 15:00:00' , 0, 16, 11, 0),
(NULL, '/news/1000027' ,'news/prod_2018-12-29_1.jpg' ,'快乐不在于有多少人追捧——职业战队选手眼中的《虚荣》' , '时间回转到四年前的秋天，手机业界巨头苹果公司在展示自家产品的同时，《虚荣》这款获得苹果全力支持开发，作为演示新iPhone的强大机能的游戏，进入了玩家们的视野。' ,'发布日期：2018-12-29 17:37:31' , 0, 17, 12, 0),
(NULL, '/news/1000028' ,'news/prod_2019-01-22_1.jpg' ,'《虚荣》触手直播活动开启：每日观看30分钟即可领取ICE！' , '触手活动开启及活动规则介绍' ,'发布日期：2019-01-22 11:00:00' , 0, 18, 13, 0),
(NULL, '/news/1000029' ,'news/prod_2019-01-23_1.jpg' ,'3.10版本英雄&装备平衡性调整' , '感谢大家的等待，让我们能更专注的对游戏质量进行优化！除了已经公布的内容外，还有一些改进优化正在进行中，游戏体验也将更上一层楼。不过现在，我们还是想先和大家分享下本期的更新内容。 ' ,'发布日期：2019-01-23 13:45:06' , 0, 19, 0, 6),
(NULL, '/news/1000030' ,'news/prod_2019-01-23_2.jpg' ,'3.10版本：荒野猎手  伊娃' , '在新版本在，又有一位全新英雄：荒野猎手 伊娃加入战场来了。快来看看吧，另外还有其他的改进优化。' ,'发布日期：2019-01-23 13:47:10' , 0, 20, 0, 7),
(NULL, '/news/1000031' ,'news/prod_2019-01-31_1.jpg' ,'《虚荣》新春展望：这个锐意革新的MOBA正在悄然变化' , '新年行大运，《虚荣》伴你行！感谢诸多玩家对于《虚荣》这款游戏的鼎力支持，在过去的一年中，《虚荣》在游戏玩法以及电子竞技方面都取得不错的进展，这要感谢《虚荣》玩家们一路坚定的支持！' ,'发布日期：2019-01-31 16:21:36' , 0, 21, 14, 0),
(NULL, '/news/1000032' ,'news/prod_2019-02-03_1.jpg' ,'《虚荣》新春直播有礼 报名开播拿奖励' , '主播们注意啦！金猪报喜，欢乐庆新春，长假期间也别忘了开启《虚荣》直播哟！在整个春节期间（2月4日-2月11日），开播海希安的勇士们均可参与猪年签到活动，累计播出4天即可领取ICE福利，还有人气现金奖励！赶快报名参加！' ,'发布日期：2019-02-03 11:00:00' , 0, 22, 15, 0),
(NULL, '/news/1000033' ,'news/prod_2019-02-11_1.jpg' ,'虚荣4.0内的游戏模式' , '现在虚荣将迎来4.0版，我们将借此机会来决定将哪几款模式列为常规模式，哪几款模式列为活动模式。这么做的目的有两个。第一，让新玩家能清晰地知道虚荣这款游戏的核心是什么。第二，通过提供不同的常规游戏模式，让不同兴趣，不同玩法的玩家都有中意的模式可玩。' ,'发布日期：2019-02-11 09:50:04' , 0, 23, 16, 0),
(NULL, '/news/1000034' ,'news/prod_2019-02-11_2.jpg' ,'4.0版本英雄&装备平衡性调整' , '4.0主要加入了新的英雄，以及新的游戏模式，更新用户界面，修复BUG，调整游戏平衡。' ,'发布日期：2019-02-11 09:51:32' , 0, 24, 0, 8),
(NULL, '/news/1000035' ,'news/prod_2019-02-11_3.jpg' ,'4.0更新：太极宗师三风' , '4.0新的英雄加入游戏。以及新的皮肤，新的可收集物件，游戏模式，UI升级，BUG修复，平衡性调整' ,'发布日期：2019-02-11 10:02:06' , 0, 25, 0, 9),
(NULL, '/events/crossplatform' ,'news/prod_2019-02-14_1.jpg' ,'《虚荣》 PC平台账号升级公告' ,'全球首个PC、移动跨平台MOBA游戏《虚荣Vainglory》的PC版将于5月21日进入Beta测试。为保障账户安全和提供更好的服务，我们将在《虚荣》PC版率先推出全新的账号安全绑定功能。' ,'发布日期：2019-02-14 10:48:41' , 2, 26, 17, 0),
(NULL, '/news/1000036' ,'news/prod_2019-02-15_1.jpg' ,'喜迎《虚荣》中文ID上线 限时免费改名' , '《虚荣Vainglory》正式迈入4.0时代，《虚荣》跨平台版本PC Alpha测试现已在国服开启！于此同时，备受中国玩家期待的新功能正式来临——游戏内现已正式支持中文ID！' ,'发布日期：2019-02-15 15:26:26' , 0, 27, 18, 0),
(NULL, '/news/1000037' ,'news/prod_2019-02-20_1.jpg' ,'WESG全球总决赛即将开战' , 'WESG 2018-2019赛季全球总决赛即将在重庆九龙坡开战，近日虚荣项目的分组也已正式公布。中国战队Hunters位于A组，将面对来自日本、韩国和美国战队的挑战。' ,'发布日期：2019-02-20 10:00:00' , 0, 28, 19, 0),
(NULL, '/news/1000038' ,'news/prod_2019-03-06_1.jpg' ,'风暴试炼正式退出虚荣' , '目前的风暴试炼没有达到大家期望。说实话，它同样也没达到我们的期望。由于玩家在游戏中可以在很多地方获得不同类型的货币奖励和物品奖励，因此大家很自然地就没怎么把风暴试炼这个“大宝藏”当回事。' ,'发布日期：2019-03-06 11:50:48' , 0, 29, 20, 0),
(NULL, '/news/1000039' ,'news/prod_2019-03-07_1.jpg' ,'不断尝试新内容的拓荒者们—《虚荣》主播采访实录' , '如果把时间调转回十多年前，没人能说得清楚“主播”是个什么职业。再往前几年，新华字典里都找不出这个词。现如今，这个群体成为了互联网时代的注脚，可以在前面加上形容词加以区分：音乐主播，游戏主播等等，甚至可以具体归结到某个游戏。' ,'发布日期：2019-03-07 14:32:46' , 0, 30, 21, 0),
(NULL, '/news/1000040' ,'news/prod_2019-03-12_1.jpg' ,'WESG 2018-2019全球总决赛，虚荣项目本周六将迎来决赛！' , '上周3月9日、3月10日两天，令人期待的WESG虚荣项目小组赛和半决赛在重庆九龙坡雅诗特酒店圆满结束。经过周末两天的激烈对战，小组赛中：美国队Tribe Gaming、韩国队Team ACE、德国队SLY、新加坡队Team Impunity成功晋级，半决赛中：德国队SLY获得季军！' ,'发布日期：2019-03-12 12:00:00' , 0, 31, 22, 0),
(NULL, '/news/1000041' ,'news/prod_2019-03-13_1.jpg' ,'4.1版本英雄&装备平衡性调整' , '虚荣4.1版本中，我们对大量英雄和装备进行了调整。我们将一如既往的专注对游戏质量和平衡性进行优化！' ,'发布日期：2019-03-13 11:30:24' , 0, 32, 0, 10),
(NULL, '/news/1000042' ,'news/prod_2018-12-14_1.jpg' ,'4.1版本-春季赛开始啦' , '4.1版本上线了新的皮肤：“阴阳宗师”三风，“动能机甲”丝凯伊等。还有一些其他的改动，快来看看吧！' ,'发布日期：2019-03-13 11:52:15' , 0, 33, 0, 11),
(NULL, '/news/1000043' ,'news/prod_2019-03-19_1.jpg' ,'WESG 虚荣全球总决赛 冠军战队Tribe Gaming赛后采访 ' , '上周六3月16日中午，WESG2018-2019全球赛虚荣项目总决赛，Tribe Gaming以大优势打败ACE，拿下本次赛事虚荣项目总冠军！恭喜他们！' ,'发布日期：2019-03-19 12:00:00' , 0, 34, 23, 0),
(NULL, '/news/1000044' ,'news/prod_2019-03-22_1.jpg' ,'此生无悔入虚荣，来生还在海希安——虚荣Vainglory，一个硬核的MOBA手游' , '我，一个菜鸟，在海希安活了975天，有些话想说。' ,'发布日期：2019-03-22 09:00:00' , 0, 35, 24, 0),
(NULL, '/news/1000045' ,'news/prod_2019-03-29_1.jpg' ,'《虚荣Vainglory》华为3月29日首发上线' , '《虚荣Vainglory》华为已于 3月29日 11: 00 正式上线，如果你是华为手机用户，即可前往华为应用市场下载游戏，不仅可以拥有不一样的MOBA体验，更有多重华为专属礼包等你拿。' ,'发布日期：2019-03-29 11:10:00' , 0, 36, 25, 0),
(NULL, '/news/1000046' ,'news/prod_2019-04-11_1.jpg' ,'即刻正当燃！ 2019《虚荣》CVPL夏季赛火热打响！' , '2019《虚荣》CVPL（即中国区职业联赛）夏季赛开战在即！' ,'发布日期：2019-04-11 11:00:00' , 0, 37, 26, 0),
(NULL, '/news/1000047' ,'news/prod_2019-04-15_1.jpg' ,'4.2版本英雄&装备平衡性调整' , '风暴高地又迎来了春暖花开的时节，我们也决定为您的游戏体验增加多一点的阳光。4.2版本将对游戏内“方方面面”进行优化！' ,'发布日期：2019-04-15 14:55:26' , 0, 38, 0, 12),
(NULL, '/news/1000048' ,'news/prod_2019-04-11_1.jpg' ,'《虚荣》2019 CVPL 夏季赛报名正式开启啦！！' , '《虚荣》MOBA竞技新时代，没有平台高下，只有实力之争！' ,'发布日期：2019-04-16 10:00:00' , 0, 39, 27, 0),
(NULL, '/news/1000049' ,'news/prod_2019-04-16_1.jpg' ,'4.2版本：神枪手凯恩' , '又是一年春暖花开，我们迎来了新英雄凯恩，他是一位手持左轮手枪的神枪手。' ,'发布日期：2019-04-16 11:00:00' , 0, 40, 0, 13),
(NULL, '/news/1000050' ,'news/prod_2019-04-19_1.jpg' ,'2019虚荣主播/解说官方集结 秀出你自己！' , '我们希望那些充满魅力的有趣灵魂能脱颖而出，作为虚荣的主播被更多人所熟识！' ,'发布日期：2019-04-19 18:00:00' , 0, 41, 28, 0),
(NULL, '/news/1000051' ,'news/prod_2019-04-25_1.jpg' ,'主播集结令 《虚荣》斗鱼主播招募' , '在这个全民竞技，全民直播的时代，作为一个优秀的《虚荣》玩家，何不到斗鱼开启直播间，把你精湛的操作，迷人的声音，风趣的头脑秀出来！' ,'发布日期：2019-04-25 09:30:00' , 0, 42, 29, 0),
(NULL, '/news/1000052' ,'news/prod_2019-05-20_1.jpg' ,'《虚荣》2019 CVPL 夏季赛报名结束 超燃赛事一触即发' , '2019《虚荣》CVPL夏季赛的报名阶段已于4月25日结束，共有161支队伍（超过800名的玩家）提交了报名申请，达到了历届大赛的顶峰！' ,'发布日期：2019-04-30 18:00:00' , 0, 43, 30, 0),
(NULL, '/news/1000053' ,'news/prod_2019-05-20_1.jpg' ,'《虚荣》2019 CVPL 海选赛首战落幕 34强战队整装再出发' , '2019《虚荣》CVPL夏季赛的海选赛正如火如荼地展开中，在五一小长假期间，经过4天的激烈角逐，入围海选赛的68支战队在5v5征召模式中通过BO3单场淘汰制顺利决出34强！' ,'发布日期：2019-05-08 12:00:00' , 0, 44, 31, 0),
(NULL, '/news/1000054' ,'news/prod_2019-05-13_1.jpg' ,'4.3版本英雄和道具平衡性调整' , '为了给您提供最佳的游戏体验，我们对游戏进行了一些积极的微调。一起来看看4.3版本的平衡性变动！' ,'发布日期：2019-05-13 10:00:00' , 0, 45, 0, 14),
(NULL, '/news/1000055' ,'news/prod_2019-05-16_1.jpg' ,'4.3版本：黑腕死神 里昂' , ' 让我们热烈欢迎新英雄加入《虚荣》大家庭。“黑腕死神”里昂，一名使用喷气涡轮巨剑的强力战士。一起来了解这名冷酷的打手和他的恐怖巨剑！ ' ,'发布日期：2019-05-16 10:00:00' , 0, 46, 0, 15),
(NULL, '/news/1000056' ,'news/prod_2019-05-20_1.jpg' ,'海选赛第二赛程本周继续 17支晋级战队即将揭晓' , '2019《虚荣》CVPL夏季赛将在本周末（5月18日-5月19日）迎来海选赛的收官之战，决出最终17支晋级预选赛的队伍名单。' ,'发布日期：2019-05-17 15:00:00' , 0, 47, 32, 0),
(NULL, '/news/1000057' ,'news/prod_2019-05-20_1.jpg' ,'《虚荣》CVPL海选赛结束 全民赛事将开启新阶段' , '《虚荣》2019年CVPL夏季赛海选收官之战在上周末顺利结束， 经过这一段时间的激烈对战，海选阵容的68支战队，共有17支战队奋力拼搏成功晋级预选赛', '发布日期：2019-05-20 18:00:00', 3, 48, 33, 0),
(NULL, '/news/1000058' ,'news/prod_2019-05-21_1.jpg' ,'多种操作同场竞技 《虚荣》正式迎来跨平台时代' , '《虚荣》新版本上线，PC端、平板端、手机端无缝对接，全新的宝船平台护航账号安全，超力度福利等待领取。 ' ,'发布日期：2019-05-21 11:00:00' , 1, 49, 34, 0),
(NULL, '/news/1000059' ,'news/prod_2019-05-21_2.jpg' ,'新版本 和人气主播一同体验跨平台《虚荣》' , '《虚荣》新版本已更新，PC beta也正式上线！可以自由选择操作模式的《虚荣》已经体验过了吗？PC端、平板端和手机端的操作都会有哪些不一样的感受呢？手机端更好操作，还是PC端输出更精确？' ,'发布日期：2019-05-21 18:00:00' , 0, 50, 35, 0),
(NULL, '/news/1000060' ,'news/prod_2019-05-22_1.jpg' ,'第二届 官方QQ群语音模仿秀活动进行中' , '新上线的PC beta有体验过了吗？是PC端还是手机平板更适合这位强力战士呢？这次，为了更彻底的了解这位新英雄，我们组织了新英雄里昂的语音模仿秀活动，精选的十句里昂台词，来秀出你的迷人声线吧！' ,'发布日期：2019-05-22 18:00:00' , 0, 51, 36, 0),
(NULL, '/news/1000061' ,'news/prod_2019-05-23_1.jpg' ,'《虚荣》抖音视频征集活动' , '虚荣官方认证的抖音账号正式上线了！更多虚荣精彩短视频，将陆续与你分享！' ,'发布日期：2019-05-23 17:00:00' , 0, 52, 37, 0),
(NULL, '/news/1000062' ,'news/prod_2019-06-06_1.jpg' ,'特邀人气主播访谈 深度解析《虚荣》跨平台MOBA' , '是大刀阔斧地冲杀还是精巧谨慎地缠斗？更宽阔的舞台让每一种战术都能游刃有余！《虚荣》新版本已经正式上线，手机、平板、PC三端同场竞技，选择风格更适合的英雄，联手搭配最默契的伙伴，打一场精彩绝伦的对抗赛，从攻坚到乱斗，炎夏六月里多种活动战场轮番开放！人气主播“脑和谐”与“鲸鱼儿”与你分享他们对《虚荣》的热爱，邀你一起加入战斗！' ,'发布日期：2019-06-06 10:00:00' , 0, 53, 38, 0),
(NULL, '/news/1000063' ,'news/prod_2019-06-06_2.jpg' ,'我们是如何应对漏洞的' , '一直以来我们十分注重与玩家的沟通，我想在此简单地分享一下SEMC修复漏洞的流程。通过我们的反馈系统，我们收到了难以计数的漏洞汇报（此时此刻我们正着手处理超过1000条反馈日志）。' ,'发布日期：2019-06-06 17:19:04' , 0, 54, 39, 0),
(NULL, '/news/1000064' ,'news/prod_2019-06-06_3.jpg' ,'6月2日运营商网络波动补偿公告' , '上周日，由于运营商网络波动原因，导致游戏服务器无法正常连接。给大家的游戏体验造成不便，对此我们再次表示非常抱歉。' ,'发布日期：2019-06-06 18:00:00' , 0, 55, 40, 0);